##Revision

In [3]:
import pandas as pd

data = {'Name':['Alice', 'Bob', 'Charlie'], 
        'Age':[25, 30, 35],
        'City':['New York', 'London', 'Paris']}

df = pd.DataFrame(data)

df.to_csv('output.csv')
df.to_csv('output_no_index.csv', index=False, header=False)

In [4]:
df.head()

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [5]:
df.tail()

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [6]:
df.sample()

      Name  Age   City
2  Charlie   35  Paris

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [8]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [10]:
df.shape

(3, 3)